RTX 4090/expr/results/omoe/qwen3-30b-a3b/20260411_173718_omoe-qwen3_limit60(*)/benchmark_RR1.4.log
[INFO] Log file: /root/workspace/expr/results/omoe/qwen3-30b-a3b/logs/20260412_024546_omoe-qwen3_limit60/benchmark_RR1.4.log
[INFO] Config saved to /root/workspace/expr/results/omoe/qwen3-30b-a3b/logs/20260412_024546_omoe-qwen3_limit60/config.json
[INFO] Checking server availability...
[INFO] Server is ready
[INFO] Model ID: /data/share/models/Qwen3-30B-A3B

>>> ============================================
>>> Benchmark RR=1.4 req/s
>>> ============================================
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x778c7efa2fc0>, trust_remote_code=False, seed=0, num_prompts=1000, dataset_name='sharegpt', no_stream=False, dataset_path='/root/workspace/dataset/ShareGPT_V3_unfiltered_cleaned_split.json', no_oversample=False, skip_chat_template=False, enable_multimodal_chat=False, disable_shuffle=False, custom_output_len=256, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, blazedit_min_distance=0.0, blazedit_max_distance=1.0, asr_max_audio_len_sec=inf, asr_min_audio_len_sec=0.0, random_input_len=1024, random_output_len=128, random_range_ratio=0.0, random_prefix_len=0, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, label=None, backend='openai', base_url='http://localhost:8000', host='127.0.0.1', port=8000, endpoint='/v1/completions', header=None, max_concurrency=None, model='/data/share/models/Qwen3-30B-A3B', input_len=None, output_len=None, tokenizer=None, tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=1.4, burstiness=1.0, disable_tqdm=False, num_warmups=0, profile=False, save_result=True, save_detailed=True, append_result=False, metadata=['framework=omoe,model=qwen3-30b-a3b,request_rate=1.4'], result_dir='/root/workspace/expr/results/omoe/qwen3-30b-a3b/logs/20260412_024546_omoe-qwen3_limit60/rr_1.4', result_filename=None, ignore_eos=False, percentile_metrics=None, metric_percentiles='99', goodput=None, request_id_prefix='bench-8b3f231e-', top_p=None, top_k=None, min_p=None, temperature=None, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name=None, lora_modules=None, lora_assignment='random', ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=0, extra_body=None, skip_tokenizer_init=False, insecure=False, plot_timeline=False, timeline_itl_thresholds=[25.0, 50.0], plot_dataset_stats=False)
WARNING: vllm bench serve no longer sets temperature==0 (greedy) in requests by default. The default will be determined on the server side and can be model/API specific. For the old behavior, include --temperature=0.
Starting initial single prompt test run...
Skipping endpoint ready check.
Starting main benchmark run...
Traffic request rate: 1.4
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: None
100%|██████████| 1000/1000 [18:45<00:00,  1.13s/it]
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     1000      
Failed requests:                         0         
Request rate configured (RPS):           1.40      
Benchmark duration (s):                  1125.40   
Total input tokens:                      217393    
Total generated tokens:                  201847    
Request throughput (req/s):              0.89      
Output token throughput (tok/s):         179.36    
Peak output token throughput (tok/s):    499.00    
Peak concurrent requests:                293.00    
Total token throughput (tok/s):          372.52    
---------------Time to First Token----------------
Mean TTFT (ms):                          7622.83   
Median TTFT (ms):                        4143.92   
P99 TTFT (ms):                           26781.56  
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          891.11    
Median TPOT (ms):                        955.37    
P99 TPOT (ms):                           1094.05   
---------------Inter-token Latency----------------
Mean ITL (ms):                           890.00    
Median ITL (ms):                         955.39    
P99 ITL (ms):                            1123.65   
==================================================
[OK] RR=1.4 done -> /root/workspace/expr/results/omoe/qwen3-30b-a3b/logs/20260412_024546_omoe-qwen3_limit60/rr_1.4/result.json

>>> ============================================
>>> Generating summary report...
>>> ============================================
  RR= 1.4: throughput=0.89 req/s, TTFT_mean=7622.8ms, TPOT_mean=891.11ms

[OK] Summary saved: /root/workspace/expr/results/omoe/qwen3-30b-a3b/logs/20260412_024546_omoe-qwen3_limit60/summary.json
[OK] Summary MD saved: /root/workspace/expr/results/omoe/qwen3-30b-a3b/logs/20260412_024546_omoe-qwen3_limit60/summary.md

============================================
  All Benchmarks Complete!
============================================
  Results:      /root/workspace/expr/results/omoe/qwen3-30b-a3b/logs/20260412_024546_omoe-qwen3_limit60
  Summary:      /root/workspace/expr/results/omoe/qwen3-30b-a3b/logs/20260412_024546_omoe-qwen3_limit60/summary.json
  Summary MD:   /root/workspace/expr/results/omoe/qwen3-30b-a3b/logs/20260412_024546_omoe-qwen3_limit60/summary.md
============================================